Напишете програма за читање елементи во матрица и проверете дали дадената матрица е симетрична матрица или не. Од стандаред влез се внесуваат димензиите на матрицата M и N соодветно и потоа се внесуваат елементите на матрицата. Ваша задача е доколку матрицата е симетрична да испечатете на екран 1, доколку не е симетрична да испечатете -1, потоа се печати самата матрица на екран.

#include <iostream>
using namespace std;

int main()
{
    int n,m;
    cin>>n>>m;
    int matrix[n][m];
    for (int i=0; i<n; i++) {
        for (int j=0; j<m; j++) {
            cin>>matrix[i][j];
        }
    }
    if (n==m&&n%2==0){
        cout<<"-1"<<endl;
    }else{
        cout<<"1"<<endl;
    }
    
    for (int i=0; i<n; i++) {
        for (int j=0; j<m; j++) {
            cout<<matrix[i][j]<<" ";
        }
        cout<<endl;
    }
}
