Oд стандарден влез се читаат броеви се додека не се прочита нешто што не е број.
За сите броеви кои што се палиндроми на екран да се испечати сума на цифри од кои што е составен бројот,
за броевите кои што не се палиндроми потребно е на екран да се испечати од колку цифри е составен бројот. 
Проверка дали бројот е палиндром, колкава е сумата на цифри или од колку цифри е составен бројот да се реализираат со посебни функции.

Дополнително функцијата за броење на цифри на број направете ја рекурзивна.


  #include <iostream>
using namespace std;
int main(){
    int n;
    
    
    while(cin>>n){
        int digit;
        int rev=0;
        int sum=0;
        int counter=0;
        int tmp=n;
        while (n!=0) {
            
            digit=n%10;
            counter++;
            sum+=digit;
            rev=(rev*10)+digit;
            n=n/10;
            
        }
        if(tmp==rev){
            cout<<sum<<endl;
        }else{
            cout<<counter<<endl;
        }
        
        
        
    }
}
