Од стандарден влез да се вчита број N и потоа да се вчитаат N елементи во една низа.

Внесената низа да се трансформира на начин што за секој втор елемент во низата, да му се додаде неговиот претходен лев сосед.

Трансформираната низа да се испечати на стандарден излез, така што елементите ќе се одвоени со празно место меѓу нив.

#include <iostream>
using namespace std;

int main(){
    
    int n;
    cin>>n;
    
    int niza[n];
    for(int i=0;i<n;i++){
        cin>>niza[i];
    }
    
    int pozicija=1;
    
    for(int i=0;i<n;i++){
        if (pozicija == 2) {
            niza[i]+=niza[i-1];
            pozicija=0;
        }
        pozicija++;
    }
    
    for(int i=0;i<n;i++){
        cout<<niza[i]<<" ";
    }
}
