Од стандарден влез да се прочита квадратна матриција со број на редици и колони N. Прво се вчитува бројот N а потоа и N*N елементите на матрицата.
Да се промени знакот на елементите од главната дијагонала на матрицата (позитивните да станат негативни и обратно). 
Да се испечати трансформираната матрица на екран (Секој елемент од матрицата се печати со 3 места - %3d).


#include <iostream>
using namespace std;

int main()
{
    int n;
    cin>>n;
    int niza[n][n];
    for (int i=0;i<n;i++){
        for(int j=0;j<n;j++){
            cin>>niza[i][j];
             
            if(i==j){
                if(niza[i][j]<0){
                    niza[i][j]*=(-1);
                }else {
                    niza[i][j]*=(-1);
                }
            }
            
        }
    }
    for(int i=0;i<n;i++){
        for(int j=0;j<n;j++){
           cout <<" "<<niza[i][j]<<" ";
        }
        cout<<endl;
    }
}
