Од стандарден влез се внесува број n (димензии за квадратна матрица). Потоа се внесува матрицата. Да се трансформира матрицата така што секој елемент кој се наоѓа во исто време под главната и споредната дијагонала во обратен број. Обратен број на некој број е ако тој е позитивен да се претвори во негативен број, а ако бројот е негативен да се претвори во позитивен број.

#include <iostream>
using namespace std;

int main()
{
    int n,m;
    cin>>n;
    int matrix[n][n];
    for (int i=0; i<n; i++) {
        for (int j=0; j<n; j++) {
            cin>>matrix[i][j];
        }
    }
    
    for(int i=0;i<n;i++){
        for(int j=0;j<n;j++){
            if(i+j>n-1){
                if(i>j){
                    matrix[i][j]*=-1;
                }
            }
        }
    }
    for (int i=0; i<n; i++) {
        for (int j=0; j<n; j++) {
            cout<<matrix[i][j]<<" ";
        }
        cout<<endl;
    }
}
