Од стандарден влез се вчитува матрица сo m редици и n колони. Прво се вчитуваат броевите m и n а потоа и елементите на матрицата.

Да се изврши min-max нормализација на секоја колона од матрицата, односно секој елемент во секоја колона да се замени со вредноста 𝑥−𝑚𝑖𝑛𝑚𝑎𝑥−𝑚𝑖𝑛 каде што x е елемент во некоја колона, а max и min се соодветно најголемиот и најмалиот елемент во соодветната колона.

Трансформираната матрица да се испечати на екран.

Објаснување на примерот:

Елементите на 0-тата колона се: 1,6,11,16,21. Минимален елемент е 1, а максимален елемент е 21

Секој од 5те елементи ќе се трансформира на следниот начин:

(1-1)/(21-1) = 0/20 = 0.00
(6-1)/(21-1) = 5/20 = 0.25
(11-1)/(21-1) = 10/20 = 0.50
(16-1)/(21-1) = 15/20 = 0.75
(21-1)/(21-1) = 20/20 = 1.00


#include <iostream>
#include <iomanip>
using namespace std;

int main()
{
    int n,m;
    cin>>n>>m;
    double nova[n][m];
    double matrix[n][m];
    
    for (int i=0;i<n;i++){
        for (int j=0;j<m;j++){
            cin>>matrix[i][j];
        }
    }
    for(int j=0;j<m;j++){
        int min=100;
        int max=0;
        for (int i=0;i<n;i++){
            if(matrix[i][j]<min){
                min=matrix[i][j];
            }
            if (matrix[i][j]>max) {
                max=matrix[i][j];
            }
        }
        for(int i=0;i<n;i++){
               nova[i][j]=double(matrix[i][j]-min)/(max-min);
                
        }
    }
    
    for (int i=0;i<n;i++){
        for (int j=0;j<m;j++){
            printf("%.2f ", nova[i][j]);
        }
        cout<<endl;
    }
}
