Од стандарден влез се чита цел број n. Потоа се вчитуваат n низи од цели броеви, при што за секоја прво се внесува должината на низата, а потоа сите елементи на низата, па на крај бројот k.



Да се напише програма која за секоја низа ќе ја трансформира истата, т.ш. секој k-ти елемент прво ќе го помножи со неговиот реден број во низата, потоа ќе го одземе неговиот следбеник.

Доколку к-тиот елемент нема следбеник, се собира со неговиот претходник.



На пример, ако е дадена следната низа:



1 2 3 4 5 6 7 8, за k=2 се добива



1 1 3 11 5 29 7 71

Да се испечатат сите трансформирани низи.


#include <iostream>
using namespace std;

int main() {
    int n;
    cin >> n;

    for (int iter = 0; iter < n; ++iter) {
        int numNiza;
        cin >> numNiza;

        int niza[numNiza];
        for (int i = 0; i < numNiza; ++i) {
            cin >> niza[i];
        }

        int k;
        cin >> k;
        
        for(int i=0;i<numNiza;i++){
            int pozicija=1;
            if((i+1)%k==0){
                niza[i]=niza[i]*(i+1);
                if(i+1<numNiza){
                    niza[i]-=niza[i+1];
                }else{
                    niza[i]+=niza[i-1];
                }
            }
        }
        for(int i=0;i<numNiza;i++){
            cout<<niza[i]<<" ";
        }
        cout<<endl;
    }

    return 0;
}

